Revit 2027 API
BuiltInFailures.RenderFailures.RenderLibNotInstalledWarn Property
 Rendering library has not been installed, so the third party geometry cannot be created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RenderLibNotInstalledWarn { get; }
Public Shared ReadOnly Property RenderLibNotInstalledWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RenderLibNotInstalledWarn {
	FailureDefinitionId^ get ();
}
static member RenderLibNotInstalledWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RenderFailures Class
Autodesk.Revit.DB Namespace